[
  {"day": 1, "tip": "Track every dollar you spend today. Awareness is the first step to wealth. Use a notes app if you have to.", "category": "mindset"},
  {"day": 2, "tip": "Set up automatic savings. Pay yourself first — even $10/week adds up to $520/year, which compounds.", "category": "savings"},
  {"day": 3, "tip": "Open a high-yield savings account. If your savings earn less than 4% APY, you're losing money to inflation.", "category": "savings"},
  {"day": 4, "tip": "Learn the Rule of 72: divide 72 by your return rate to see how many years it takes to double. At 7%, that's ~10 years.", "category": "investing"},
  {"day": 5, "tip": "Cancel one subscription you haven't used in the last 30 days. Redirect that money to savings.", "category": "habits"},
  {"day": 6, "tip": "Start a side income stream this week — freelancing, selling unused items, tutoring. Any extra dollar is a dollar invested.", "category": "income"},
  {"day": 7, "tip": "Write down your exact net worth right now. Assets minus debts. Do this monthly. What gets measured gets managed.", "category": "mindset"},
  {"day": 8, "tip": "If your employer matches 401(k) contributions and you're not maxing the match, you're refusing free money. Fix that today.", "category": "investing"},
  {"day": 9, "tip": "Use the 24-hour rule: wait a full day before any non-essential purchase over $50. Most impulses fade.", "category": "habits"},
  {"day": 10, "tip": "Research index funds today. The S&P 500 has averaged ~10% annual returns since 1926. Low fees beat most active managers.", "category": "investing"},
  {"day": 11, "tip": "Negotiate one bill this week — phone, internet, insurance. A 15-minute call can save hundreds per year.", "category": "negotiation"},
  {"day": 12, "tip": "Build a $1,000 emergency fund before investing. Financial emergencies at 20%+ credit card interest destroy wealth faster than markets build it.", "category": "savings"},
  {"day": 13, "tip": "Read one page about personal finance today. Books like 'The Psychology of Money' or 'I Will Teach You to Be Rich' shift how you think.", "category": "mindset"},
  {"day": 14, "tip": "Calculate your true hourly wage: salary minus commute costs, work clothes, and stress spending, divided by total hours including commute.", "category": "mindset"},
  {"day": 15, "tip": "Pay off your highest-interest debt first (avalanche method). Every dollar of interest paid is a dollar that can't compound for you.", "category": "savings"},
  {"day": 16, "tip": "Ask for a raise or promotion. Research shows 70% of people who ask receive some increase. The worst outcome is 'not yet.'", "category": "negotiation"},
  {"day": 17, "tip": "Automate your investments with dollar-cost averaging. Set a recurring buy every payday. Remove the emotion from investing.", "category": "investing"},
  {"day": 18, "tip": "Cook at home 5 days this week instead of eating out. The average American spends $3,500/year on restaurants — that's a vacation or an investment.", "category": "habits"},
  {"day": 19, "tip": "Learn one new skill that increases your earning power. Coding, data analysis, sales, writing — skills compound like interest.", "category": "income"},
  {"day": 20, "tip": "Review your bank and credit card statements for charges you don't recognize. Subscription creep steals $200+/month from the average person.", "category": "habits"},
  {"day": 21, "tip": "Open a Roth IRA if you're eligible. Tax-free growth over decades is one of the most powerful wealth tools available to individuals.", "category": "investing"},
  {"day": 22, "tip": "Practice saying 'I'll think about it' instead of 'yes' to spending pressure. Social spending is the silent budget killer.", "category": "mindset"},
  {"day": 23, "tip": "Set a specific financial goal with a deadline. Not 'save more money' but 'save $5,000 by December for an emergency fund.'", "category": "mindset"},
  {"day": 24, "tip": "Research your market value on Glassdoor, Levels.fyi, or Payscale. You can't negotiate what you don't know you're worth.", "category": "negotiation"},
  {"day": 25, "tip": "Diversify your income sources. Relying on one paycheck is a single point of failure. Add freelance work, dividends, or a side project.", "category": "income"},
  {"day": 26, "tip": "Implement the 50/30/20 rule: 50% needs, 30% wants, 20% savings. Adjust the ratios, but always pay the savings category.", "category": "savings"},
  {"day": 27, "tip": "Invest in yourself: a $200 course that lands a $5,000 raise is a 2,400% return. No stock market can beat that.", "category": "income"},
  {"day": 28, "tip": "Batch your errands and shopping. Fewer trips means less impulse buying, less gas, and more time — your most valuable asset.", "category": "habits"},
  {"day": 29, "tip": "Before your next job offer, negotiate. Counter the first offer by 10-15%. Most employers expect it. Silence after you ask is your friend.", "category": "negotiation"},
  {"day": 30, "tip": "Review everything you've done this month. Wealth is built by systems, not one-time actions. Keep the habits that worked. Drop what didn't.", "category": "mindset"}
]
